app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY name ASC
---
  def index
    @categories = Category.all.order('name ASC')

SELECT  "movies".* FROM "movies" INNER JOIN "categories_movies" ON "movies"."id" = "categories_movies"."movie_id" WHERE "categories_movies"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 4], ["LIMIT", 6], ["OFFSET", 0]]
---
  def search_movies
    movies = @category.movies.page(params[:page])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_category
    @category = Category.find_by(id: params[:id])