app/controllers/movies_controller.rb

   def index
     @movies = Movie.page(params[:page])
---
SELECT COUNT(*) FROM "movies"
SELECT  "movies".* FROM "movies" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]

  def find_movie
    @movie = Movie.find_by(id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def find_category
   @categories_ids = @movie.categories.map(&:id)
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_movies" ON "categories"."id" = "categories_movies"."category_id" WHERE "categories_movies"."movie_id" = $1  [["movie_id", 1]]