app/models/movie.rb

SELECT AVG("ratings"."grade") FROM "ratings" WHERE "ratings"."movie_id" = $1  [["movie_id", 1]]
---
  def average_rating
     Rating.where(movie_id: id).average(:grade)